mock-example/src/test/resources/xml/BBMO/SrvGetClientReferenceDataRq/rq1.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
   <soap:Header>
      <mq:AsyncHeader xmlns:mq="http://sbrf.ru/prpc/mq/headers">
         <mq:message-id>message-id</mq:message-id>
         <mq:request-time>2014-12-16T17:55:06.410+04:00</mq:request-time>
         <mq:operation-name>SrvGetClientReferenceData</mq:operation-name>
      </mq:AsyncHeader>
   </soap:Header>
   <soap:Body>
      <tns:SrvGetClientReferenceDataRq xmlns:tns="http://sbrf.ru/prpc/bbmo/10"><!--optional--><ct:ExtensionData xmlns:ct="http://sbrf.ru/prpc/bbmo/commonTypes/10"/>
         <!--optional--><tns:ClientId>1234567890</tns:ClientId>
         <!--optional--><tns:BankSubdivision>
            <tns:TB>str</tns:TB>
            <tns:OSB>string</tns:OSB>
            <tns:VSP>string</tns:VSP>
         </tns:BankSubdivision>
         <!--optional--><tns:TaxId>string</tns:TaxId>
         <!--optional--><tns:TaxRegReasonCode>string</tns:TaxRegReasonCode>
         <!--optional--><tns:AgreementIdentifier>string</tns:AgreementIdentifier>
      </tns:SrvGetClientReferenceDataRq>
   </soap:Body>
</soap:Envelope>
